{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "dtype": "float32", "strides": [1, 1], "name": "conv2d_1", "filters": 32, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.001}}, "batch_input_shape": [null, 64, 64, 1], "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [6, 6], "bias_regularizer": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "scale": true, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.001}}, "filters": 64, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_2", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "scale": true, "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.001}}, "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "name": "conv2d_3", "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "beta_constraint": null, "beta_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "scale": true, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.001}}, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "use_bias": true}}]}